Reports/РезультатыОпросовПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>РезультатыОпросовПоКомпетенциям</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/ОпросыПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОпросыПоКомпетенциям</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияЭкспертов</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗаполненияРеспондентовВОценке360</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииОценивающиеЭксперты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОткрытыеВопросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулировкаРазделаОткрытыхВопросов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оцениваемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОпроса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭкспертыЕдиныйНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭксперты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОткрытыеВопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/РезультатыОпросовПоКомпетенциям/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ДокументРезультат.Очистить();
	
	ПараметрОпросПоКомпетенциям = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОпросПоКомпетенциям"));
	ОпросПоКомпетенциям = ПараметрОпросПоКомпетенциям.Значение;
	Если Не ЗначениеЗаполнено(ОпросПоКомпетенциям) Тогда
		Возврат;
	КонецЕсли;
	
	КлючВарианта = НастройкиОтчета.ДополнительныеСвойства.КлючПредопределенногоВарианта;
	
	Если КлючВарианта = Неопределено Тогда
		КлючВарианта = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	КонецЕсли;
	
	Если КлючВарианта = "РезультатыОпросаПоКомпетенциям" Тогда
		
		Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическоеЛицо") Тогда
				Если ЭлементОтбора.Использование Тогда
					ФизическиеЛица = ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения();
				Иначе
					ФизическиеЛица = ОпросПоКомпетенциям.Оцениваемые.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		РеквизитыОпроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОпросПоКомпетенциям,
			"Наименование, ПрофильДолжности, ДатаНачала, ДатаОкончания");
		
		ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
		ПараметрыПолучения.НачалоПериода = РеквизитыОпроса.ДатаНачала;
		ПараметрыПолучения.ОкончаниеПериода = РеквизитыОпроса.ДатаОкончания;
		ПараметрыПолучения.КадровыеДанные = "ФИОПолные, Возраст, Организация,"
			+ "РабочееМестоПериодРегистрации, Подразделение, РуководительСтруктурногоПодразделения, Должность";
		УстановитьПривилегированныйРежим(Истина);
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолучения);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не ЗначениеЗаполнено(СотрудникиОрганизации) Тогда
			Возврат;
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РезультатыОпросовПоКомпетенциям.ГрупповаяОценка");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НаименованиеОпроса = РеквизитыОпроса.Наименование;
		ОбластьШапка.Параметры.ПрофильДолжности = РеквизитыОпроса.ПрофильДолжности;
		ОбластьШапка.Параметры.ДатаНачала = Формат(РеквизитыОпроса.ДатаНачала, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаОкончания = Формат(РеквизитыОпроса.ДатаОкончания, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаОтчета = ТекущаяДатаСеанса();
		ДокументРезультат.Вывести(ОбластьШапка);
		
		Для Каждого ФизическоеЛицо Из ФизическиеЛица Цикл
			НайденныеСтроки = СотрудникиОрганизации.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока = НайденныеСтроки[0];
			ОбластьСотрудник = Макет.ПолучитьОбласть("Сотрудник");
			ОбластьСотрудник.Параметры.ФИО = НайденнаяСтрока.ФИОПолные;
			ОбластьСотрудник.Параметры.Возраст = НайденнаяСтрока.Возраст;
			ОбластьСотрудник.Параметры.Должность = НайденнаяСтрока.Должность;
			ОбластьСотрудник.Параметры.Организация = НайденнаяСтрока.Организация;
			ОбластьСотрудник.Параметры.Подразделение = НайденнаяСтрока.Подразделение;
			ЗаполнитьФотографиюФизическогоЛица(ОбластьСотрудник, ФизическоеЛицо);
			ДокументРезультат.Вывести(ОбластьСотрудник);
		КонецЦикла;
		
		ВывестиШкалу(Макет, ОпросПоКомпетенциям, ДокументРезультат);
		
	Иначе
		
		ФизическоеЛицо = Неопределено;
		
		Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическоеЛицо") И ЭлементОтбора.Использование Тогда
				ФизическоеЛицо = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;
		КонецЦикла;
		
		Если ФизическоеЛицо = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РеквизитыОпроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОпросПоКомпетенциям,
			"Наименование, ПрофильДолжности, ДатаНачала, ДатаОкончания");
		
		ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолучения.СписокФизическихЛиц = ФизическоеЛицо;
		ПараметрыПолучения.НачалоПериода = РеквизитыОпроса.ДатаНачала;
		ПараметрыПолучения.ОкончаниеПериода = РеквизитыОпроса.ДатаОкончания;
		ПараметрыПолучения.КадровыеДанные = "ФИОПолные, Возраст, Организация,"
			+ "РабочееМестоПериодРегистрации, Подразделение, РуководительСтруктурногоПодразделения, Должность,"
			+ "ВладеемыйЯзык1, ВладеемыйЯзык1СтепеньЗнания, ВладеемыйЯзык2, ВладеемыйЯзык2СтепеньЗнания";
		УстановитьПривилегированныйРежим(Истина);
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
		УстановитьПривилегированныйРежим(Ложь);

		Если Не ЗначениеЗаполнено(СотрудникиОрганизации) Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеСотрудника = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СотрудникиОрганизации[0]);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РезультатыОпросовПоКомпетенциям.ИндивидуальнаяОценка");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НаименованиеОпроса = РеквизитыОпроса.Наименование;
		ОбластьШапка.Параметры.ДатаНачала = Формат(РеквизитыОпроса.ДатаНачала, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаОкончания = Формат(РеквизитыОпроса.ДатаОкончания, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаОтчета = ТекущаяДатаСеанса();
		ОбластьШапка.Параметры.ФИО = ДанныеСотрудника.ФИОПолные;
		ОбластьШапка.Параметры.Возраст = ДанныеСотрудника.Возраст;
		ОбластьШапка.Параметры.Должность = ДанныеСотрудника.Должность;
		ОбластьШапка.Параметры.ПрофильДолжности = РеквизитыОпроса.ПрофильДолжности;
		ОбластьШапка.Параметры.ДатаНазначенияНаТекущуюДолжность = ДанныеСотрудника.РабочееМестоПериодРегистрации;
		ОбластьШапка.Параметры.Организация = ДанныеСотрудника.Организация;
		ОбластьШапка.Параметры.Подразделение = ДанныеСотрудника.Подразделение;
		ОбластьШапка.Параметры.Руководитель = ДанныеСотрудника.РуководительСтруктурногоПодразделения;
		ЗаполнитьФотографиюФизическогоЛица(ОбластьШапка, ФизическоеЛицо);
		ДокументРезультат.Вывести(ОбластьШапка);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ФизическиеЛица", ФизическоеЛицо);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТСотрудники
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка В (&ФизическиеЛица)";
		
		Запрос.Выполнить();
		
		ВывестиОбразование(МенеджерВременныхТаблиц, Макет, ДокументРезультат);
		ВывестиТрудовуюДеятельность(МенеджерВременныхТаблиц, Макет, ДокументРезультат);
		
		Если ЗначениеЗаполнено(ДанныеСотрудника.ВладеемыйЯзык1)
			Или ЗначениеЗаполнено(ДанныеСотрудника.ВладеемыйЯзык2) Тогда
			ВывестиЗнаниеЯзыков(Макет, ДанныеСотрудника, ДокументРезультат);
		КонецЕсли;
		
		ВывестиЭкспертов(Макет, ОпросПоКомпетенциям, РеквизитыОпроса, ДокументРезультат, ФизическоеЛицо);
		ВывестиШкалу(Макет, ОпросПоКомпетенциям, ДокументРезультат);
		
	КонецЕсли;
	
	СтруктураКомпоновки = НастройкиОтчета.Структура;
	Для Каждого ЭлементСтруктуры Из СтруктураКомпоновки Цикл
		Если ЭлементСтруктуры.Имя = "ГруппировкаСДиаграммой" Тогда
			ЗначенияШкалы = ЗначенияШкалыВОпросе(ОпросПоКомпетенциям);
			Если ЗначенияШкалы.Количество() > 0 Тогда
				ПараметрыВыводаДиаграммы = ЭлементСтруктуры.Структура[0].ПараметрыВывода;
				ПараметрТипДиаграммы = ПараметрыВыводаДиаграммы.Элементы.Найти("ТипДиаграммы");
				ОсьЗначений = ПараметрТипДиаграммы.ЗначенияВложенныхПараметров.Найти("ТипДиаграммы.ОсьЗначений");
				ОсьЗначений.Использование = Истина;
				ОсьЗначений.Значение.СпособОпределенияМаксимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
				ОсьЗначений.Значение.МаксимальноеЗначение = ЗначенияШкалы[0].Балл;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МакетКомпоновкиДанных = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанных(СхемаКомпоновкиДанных,
		НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	ВыводитсяДиаграмма = Ложь;
	Пока ЭлементРезультата <> Неопределено Цикл
		
		Если Не ВыводитсяДиаграмма Тогда
			ОписаниеМакета = МакетКомпоновкиДанных.Макеты.Найти(ЭлементРезультата.Макет);
			Если ОписаниеМакета <> Неопределено Тогда
				Если ТипЗнч(ОписаниеМакета.Макет) = Тип("МакетДиаграммыОбластиКомпоновкиДанных")
					И ОписаниеМакета.Макет.Оформление.Элементы[0].Значение = ТипДиаграммы.ГистограммаГоризонтальная Тогда
					ВыводитсяДиаграмма = Истина;
					НачалоДиаграммы = ДокументРезультат.ВысотаТаблицы;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		
		Если ВыводитсяДиаграмма И ЭлементРезультата.ТипЭлемента = ТипЭлементаРезультатаКомпоновкиДанных.Конец Тогда
			КоличествоРисунков = ДокументРезультат.Рисунки.Количество();
			Если КоличествоРисунков > 0 Тогда
				Рисунок = ДокументРезультат.Рисунки[КоличествоРисунков - 1];
				Если Рисунок.Объект.КоличествоТочек < 6 Тогда
					КонецДиаграммы = ДокументРезультат.ВысотаТаблицы;
					Область = ДокументРезультат.Область(НачалоДиаграммы, , КонецДиаграммы);
					Область.АвтовысотаСтроки = Ложь;
					Область.ВысотаСтроки = 3;
				КонецЕсли;
				ВыводитсяДиаграмма = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ОпросПоКомпетенциям"));
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Параметры;
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриОпределенииПараметровВыбора.СвойстваНастройки
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если СвойстваНастройки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица") Тогда
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = Справочники.ОпросыПоКомпетенциям.ТекстЗапросаОцениваемыеВОпросе();
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("Опрос", 
			КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОпросПоКомпетенциям")).Значение);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьФотографиюФизическогоЛица(Макет, ФизическоеЛицо)
	
	АдресФотографии = КадровыйУчетРасширенный.АдресФотографииФизическогоЛица(ФизическоеЛицо);
	
	Если ПустаяСтрока(АдресФотографии) Тогда
		Макет.Рисунки.Фотография.Картинка = БиблиотекаКартинок.Силуэт;
		Возврат;
	КонецЕсли;

	Фотография = ПолучитьИзВременногоХранилища(АдресФотографии);
	Макет.Рисунки.Фотография.Картинка = ?(ТипЗнч(Фотография) = Тип("Картинка"), Фотография, Новый Картинка(Фотография));
	
КонецПроцедуры

Процедура ВывестиОбразование(МенеджерВременныхТаблиц, Макет, ДокументРезультат)
	
	ОписаниеВТ = Новый Структура("ИмяВременнойТаблицыОтборовФизическихЛиц,ИмяПоляФизическоеЛицо", "ВТСотрудники", "ФизическоеЛицо");
	КадровыйУчет.СоздатьВТОбразованияФизическихЛиц(МенеджерВременныхТаблиц, Истина, ОписаниеВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образование.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Образование.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Образование.ВидОбразования КАК ВидОбразования,
		|	Образование.Начало КАК Начало,
		|	Образование.Окончание КАК Окончание,
		|	Образование.Квалификация КАК Квалификация,
		|	Образование.Специальность КАК Специальность,
		|	Образование.НаименованиеКурса КАК НаименованиеКурса
		|ПОМЕСТИТЬ ВТОбразование
		|ИЗ
		|	ВТОбразованияФизическихЛиц КАК Образование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновноеОбразование.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсновноеОбразование.УчебноеЗаведение КАК УчебноеЗаведение,
		|	ОсновноеОбразование.ВидОбразования КАК ВидОбразования,
		|	ОсновноеОбразование.Начало КАК Начало,
		|	ОсновноеОбразование.Окончание КАК Окончание,
		|	ОсновноеОбразование.Квалификация КАК Квалификация,
		|	ОсновноеОбразование.Специальность КАК Специальность,
		|	ОсновноеОбразование.НаименованиеКурса КАК НаименованиеКурса
		|ИЗ
		|	ВТОбразование КАК ОсновноеОбразование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновноеОбразование.ФизическоеЛицо,
		|	ОсновноеОбразование.Окончание УБЫВ";
	
	Образование =  Запрос.Выполнить().Выгрузить();
	Если Образование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбластьШапкаОбразование = Макет.ПолучитьОбласть("ШапкаОбразование");
	ДокументРезультат.Вывести(ОбластьШапкаОбразование);
	
	ОбластьСтрокаОбразование= Макет.ПолучитьОбласть("СтрокаОбразование");
	Для Каждого СтрокаОбразование Из Образование Цикл
		ОбластьСтрокаОбразование.Параметры.ДатаОкончания = СтрокаОбразование.Окончание;
		ОбластьСтрокаОбразование.Параметры.ВидОбразования = СтрокаОбразование.ВидОбразования;
		ОбластьСтрокаОбразование.Параметры.Специальность = СтрокаОбразование.Специальность;
		ОбластьСтрокаОбразование.Параметры.УчебноеЗаведение = СтрокаОбразование.УчебноеЗаведение;
		ДокументРезультат.Вывести(ОбластьСтрокаОбразование);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЗнаниеЯзыков(Макет, ДанныеСотрудника, ДокументРезультат)
	
	ОбластьШапкаЗнаниеЯзыков = Макет.ПолучитьОбласть("ШапкаЗнаниеЯзыков");
	ДокументРезультат.Вывести(ОбластьШапкаЗнаниеЯзыков);
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.ВладеемыйЯзык1) Тогда
		ОбластьСтрокаЗнаниеЯзыков = Макет.ПолучитьОбласть("СтрокаЗнаниеЯзыков");
		ОбластьСтрокаЗнаниеЯзыков.Параметры.Язык = ДанныеСотрудника.ВладеемыйЯзык1;
		ОбластьСтрокаЗнаниеЯзыков.Параметры.СтепеньВладения = ДанныеСотрудника.ВладеемыйЯзык1СтепеньЗнания;
		ДокументРезультат.Вывести(ОбластьСтрокаЗнаниеЯзыков);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.ВладеемыйЯзык2) Тогда
		ОбластьСтрокаЗнаниеЯзыков = Макет.ПолучитьОбласть("СтрокаЗнаниеЯзыков");
		ОбластьСтрокаЗнаниеЯзыков.Параметры.Язык = ДанныеСотрудника.ВладеемыйЯзык2;
		ОбластьСтрокаЗнаниеЯзыков.Параметры.СтепеньВладения = ДанныеСотрудника.ВладеемыйЯзык2СтепеньЗнания;
		ДокументРезультат.Вывести(ОбластьСтрокаЗнаниеЯзыков);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиТрудовуюДеятельность(МенеджерВременныхТаблиц, Макет, ДокументРезультат)
	
	ОписаниеВТ = Новый Структура("ИмяВременнойТаблицыОтборовФизическихЛиц,ИмяПоляФизическоеЛицо", "ВТСотрудники", "ФизическоеЛицо");
	Запрос = КадровыйУчетРасширенный.ЗапросВТТрудоваяДеятельностьФизическихЛиц(Истина, ОписаниеВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТрудоваяДеятельностьФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТТрудоваяДеятельностьФизическихЛиц.ДатаНачала КАК ДатаНачала,
	|	ВТТрудоваяДеятельностьФизическихЛиц.ДатаОкончания КАК ДатаОкончания,
	|	ВТТрудоваяДеятельностьФизическихЛиц.Организация КАК Организация,
	|	ВТТрудоваяДеятельностьФизическихЛиц.Должность КАК Должность
	|ИЗ
	|	ВТТрудоваяДеятельностьФизическихЛиц КАК ВТТрудоваяДеятельностьФизическихЛиц
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТТрудоваяДеятельностьФизическихЛиц.ФизическоеЛицо,
	|	ВТТрудоваяДеятельностьФизическихЛиц.ДатаНачала";
	
	ТрудоваяДеятельность =  Запрос.Выполнить().Выгрузить();
	Если ТрудоваяДеятельность.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьШапкаТрудоваяДеятельность = Макет.ПолучитьОбласть("ШапкаТрудоваяДеятельность");
	ДокументРезультат.Вывести(ОбластьШапкаТрудоваяДеятельность);
	
	ОбластьСтрокаТрудоваяДеятельность= Макет.ПолучитьОбласть("СтрокаТрудоваяДеятельность");
	Для Каждого ПериодТрудовойДеятельности Из ТрудоваяДеятельность Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТрудоваяДеятельность.Параметры, ПериодТрудовойДеятельности);
		ДокументРезультат.Вывести(ОбластьСтрокаТрудоваяДеятельность);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЭкспертов(Макет, ОпросПоКомпетенциям, РеквизитыОпроса, ДокументРезультат, ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОпросыПоКомпетенциямОценивающиеЭкспертыЕдиныйНабор.ОценивающийЭксперт КАК ОценивающийЭксперт,
		|	ОпросыПоКомпетенциямОценивающиеЭкспертыЕдиныйНабор.РольЭксперта КАК РольЭксперта
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.ОценивающиеЭкспертыЕдиныйНабор КАК ОпросыПоКомпетенциямОценивающиеЭкспертыЕдиныйНабор
		|ГДЕ
		|	ОпросыПоКомпетенциямОценивающиеЭкспертыЕдиныйНабор.Ссылка = &ОпросПоКомпетенциям
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОпросыПоКомпетенциямОценивающиеЭксперты.ОценивающийЭксперт,
		|	ОпросыПоКомпетенциямОценивающиеЭксперты.РольЭксперта
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.ОценивающиеЭксперты КАК ОпросыПоКомпетенциямОценивающиеЭксперты
		|ГДЕ
		|	ОпросыПоКомпетенциямОценивающиеЭксперты.Ссылка = &ОпросПоКомпетенциям
		|	И ОпросыПоКомпетенциямОценивающиеЭксперты.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ОпросПоКомпетенциям", ОпросПоКомпетенциям);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	ЭкспертыИРоли = Запрос.Выполнить().Выгрузить();
	
	Если ЭкспертыИРоли.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ЭкспертыИРоли.ВыгрузитьКолонку("ОценивающийЭксперт");
	ПараметрыПолучения.НачалоПериода = РеквизитыОпроса.ДатаНачала;
	ПараметрыПолучения.ОкончаниеПериода = РеквизитыОпроса.ДатаОкончания;
	ПараметрыПолучения.КадровыеДанные = "ФИОПолные, Подразделение, Должность";
	УстановитьПривилегированныйРежим(Истина);
	ДанныеЭкспертов = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыПолучения);
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбластьШапкаУчастникиОценки = Макет.ПолучитьОбласть("ШапкаУчастникиОценки");
	ДокументРезультат.Вывести(ОбластьШапкаУчастникиОценки);
	
	ОбластьСтрокаУчастникиОценки= Макет.ПолучитьОбласть("СтрокаУчастникиОценки");
	Для Каждого СтрокаЭксперт Из ЭкспертыИРоли Цикл
		НайденныеСтроки = ДанныеЭкспертов.НайтиСтроки(Новый Структура("ФизическоеЛицо", СтрокаЭксперт.ОценивающийЭксперт));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДанныеЭксперта = НайденныеСтроки[0];
		ОбластьСтрокаУчастникиОценки.Параметры.ФИО = ДанныеЭксперта.ФИОПолные;
		ОбластьСтрокаУчастникиОценки.Параметры.РольЭксперта = СтрокаЭксперт.РольЭксперта;
		ОбластьСтрокаУчастникиОценки.Параметры.Должность = ДанныеЭксперта.Должность;
		ОбластьСтрокаУчастникиОценки.Параметры.Подразделение = ДанныеЭксперта.Подразделение;
		ДокументРезультат.Вывести(ОбластьСтрокаУчастникиОценки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиШкалу(Макет, ОпросПоКомпетенциям, ДокументРезультат)
	
	ЗначенияШкалы = ЗначенияШкалыВОпросе(ОпросПоКомпетенциям);
	
	Если ЗначенияШкалы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьШапкаШкалаЗначений = Макет.ПолучитьОбласть("ШапкаШкалаЗначений");
	ОбластьШапкаШкалаЗначений.Параметры.НаименованиеШкалы = ЗначенияШкалы[0].НаименованиеШкалы;
	ДокументРезультат.Вывести(ОбластьШапкаШкалаЗначений);
	
	ОбластьСтрокаШкалаЗначений = Макет.ПолучитьОбласть("СтрокаШкалаЗначений");
	Для Каждого ЗначениеШкалы Из ЗначенияШкалы Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаШкалаЗначений.Параметры, ЗначениеШкалы);
		ОбластьСтрокаШкалаЗначений.Параметры.Балл = Строка(ЗначениеШкалы.Балл);
		ДокументРезультат.Вывести(ОбластьСтрокаШкалаЗначений);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначенияШкалыВОпросе(ОпросПоКомпетенциям)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОпросыПоКомпетенциямХарактеристики.Характеристика.ШкалаЗначений КАК ШкалаЗначений
		|ПОМЕСТИТЬ ВТШкала
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Характеристики КАК ОпросыПоКомпетенциямХарактеристики
		|ГДЕ
		|	ОпросыПоКомпетенциямХарактеристики.Ссылка = &ОпросПоКомпетенциям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗначенияХарактеристик.ЧисловоеЗначение, 0) КАК Балл,
		|	ЗначенияХарактеристик.Наименование КАК Наименование,
		|	ВТШкала.ШкалаЗначений.Наименование КАК НаименованиеШкалы
		|ИЗ
		|	ВТШкала КАК ВТШкала
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО ВТШкала.ШкалаЗначений = ЗначенияХарактеристик.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Балл УБЫВ";
	Запрос.УстановитьПараметр("ОпросПоКомпетенциям", ОпросПоКомпетенциям);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
